//
//  Category.swift
//  FirebaseTemplate
//
//  Created by moahammed on 7/15/20.
//  Copyright © 2020 OMAR. All rights reserved.
//

import Foundation
import UIKit

struct Category {
    var categoryName: String = ""
    var doctors: [String]
    var brief: String = ""

    
    func categoryImage() -> UIImage {
        return UIImage(named: categoryName)!
    }
}
    
    var category: [Category] = [
        Category(categoryName: "طب العائلة", doctors: ["جميلة خالد-3", "جميلة خالد-2", "جميلة خالد-1", "جميلة خالد"], brief: "د. جميلة خالد هي دكتور طب عائلة تمتلك  أكثر من ١٠ سنوات خبرة في مجال الطب العام وطب الأطفال وغيره، يستقبل د. جميلة خالد جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "دكتور قلب", doctors: ["أحمد فاضل-3", "أحمد فاضل-2", "أحمد فاضل-1", "أحمد فاضل"], brief: "د. أحمد فاضل  هي دكتور وجراح قلب تمتلك  أكثر من ١٦ سنوات خبرة في مجال القسطرة وأمراض القلب وغيره، يستقبل د. أحمد فاضل جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "دكتور عيون", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "بدر قاسم"], brief: "د. بدر قاسم هو دكتور وجراحة سمنة يمتلك  أكثر من ٦  سنوات خبرة في مجال النظروغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "دكتور أنف واذن وحنجرة", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "بدر قاسم"], brief: "د. بدر قاسم هو دكتور وجراحة سمنة يمتلك  أكثر من ٦  سنوات خبرة في مجال الانف والاذن والحنجرة وغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "دكتور أسنان", doctors: ["محمد علي", "فاطمة محمد", "جاسم علي", "بدر قاسم"], brief: "د. محمد علي هو دكتور أسنان يمتلك  أكثر من ٣ سنوات خبرة في مجال الطب العام وطب الأطفال وطب الجراحة وغيره، يستقبل د. محمد علي جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "جراحة تجميلية", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "بدر قاسم"], brief: "د. بدر قاسم هو دكتور وجراحة تجميلية يمتلك  أكثر من ٧ سنوات خبرة في مجال الجراحات التجميلية للوجه والانف وغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "جراحة السمنة", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "بدر قاسم"], brief: "د. بدر قاسم هو دكتور وجراحة سمنة يمتلك  أكثر من ٠ سنوات خبرة في مجال الجراحات السمنة المفرطة والجراحة العامة وغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "الامراض الجلدية", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "بدر قاسم"], brief: "د. بدر قاسم هو دكتور وجراحة سمنة يمتلك  أكثر من ٠ سنوات خبرة في مجال الامراض الجلدية والجراحة العامة وغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "أمراض النساء والولادة", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "بدر قاسم"], brief: "د. بدر قاسم هو دكتور وجراحة سمنة يمتلك  أكثر من ٦  سنوات خبرة في مجال الولادة وغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله"),
        Category(categoryName: "أمراض المسالك البولية", doctors: ["بدر قاسم", "بدر قاسم", "بدر قاسم", "د"], brief: "د. بدر قاسم هو دكتور وجراحة سمنة يمتلك  أكثر من ٦  سنوات خبرة في مجال امراض المسالك البولية وغيره، يستقبل د. بدر قاسم جميع الاستشارات المتعلقة بمجاله")
    ]

